src/CF/Catalogs/ПозицииДляОказанияУслугЗаВремяНомера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>ПозицииДляОказанияУслугЗаВремяНомера</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойШтрихКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>129</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Секция</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияПозиции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Высота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ширина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Виртуальная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SKU</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Средство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СредстваПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеАктивно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроЗакрепленныеСотрудники</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗакрепленныеСотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РольСотрудника</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыРолейСотрудников</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОСтроке</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CF/Catalogs/ПозицииДляОказанияУслугЗаВремяНомера/Ext/ManagerModule.bsl
// sza160221-0217

Процедура НаПечать(ТабДок, Ссылка) Экспорт

	Макет = Справочники.ПозицииДляОказанияУслугЗаВремяНомера.ПолучитьМакет("НаПечать");

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПозицииДляОказанияУслугЗаВремяНомера.SKU,
	|	ПозицииДляОказанияУслугЗаВремяНомера.Вес,
	|	ПозицииДляОказанияУслугЗаВремяНомера.ВидЦен,
	|	ПозицииДляОказанияУслугЗаВремяНомера.Виртуальная,
	|	ПозицииДляОказанияУслугЗаВремяНомера.Высота,
	|	ПозицииДляОказанияУслугЗаВремяНомера.ДатаНачала,
	|	ПозицииДляОказанияУслугЗаВремяНомера.ДатаОкончания,
	|	ПозицииДляОказанияУслугЗаВремяНомера.Длина,
	|	ПозицииДляОказанияУслугЗаВремяНомера.КатегорияПозиции,
	|	ПозицииДляОказанияУслугЗаВремяНомера.Код,
	|	ВЫРАЗИТЬ(ПозицииДляОказанияУслугЗаВремяНомера.Комментарий КАК Строка(1000)) КАК Комментарий,
	|	ПозицииДляОказанияУслугЗаВремяНомера.Наименование,
	|	ПозицииДляОказанияУслугЗаВремяНомера.НеАктивно,
	|	ПозицииДляОказанияУслугЗаВремяНомера.ОсновнойШтрихКод,
	|	ПозицииДляОказанияУслугЗаВремяНомера.ПроЗакрепленныеСотрудники,
	|	ПозицииДляОказанияУслугЗаВремяНомера.Секция,
	|	ПозицииДляОказанияУслугЗаВремяНомера.Склад,
	|	ПозицииДляОказанияУслугЗаВремяНомера.Средство,
	|	ПозицииДляОказанияУслугЗаВремяНомера.Ширина,
	|	ПозицииДляОказанияУслугЗаВремяНомера.ЗакрепленныеСотрудники.(
	|		НомерСтроки,
	|		Сотрудник,
	|		РольСотрудника,
	|		ОСтроке
	|	)
	|ИЗ Справочник.ПозицииДляОказанияУслугЗаВремяНомера КАК ПозицииДляОказанияУслугЗаВремяНомера
	|ГДЕ ПозицииДляОказанияУслугЗаВремяНомера.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);

	Выборка = Запрос.Выполнить().Выбрать();
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьЗакрепленныеСотрудникиШапка = Макет.ПолучитьОбласть("ЗакрепленныеСотрудникиШапка");
	ОбластьЗакрепленныеСотрудники = Макет.ПолучитьОбласть("ЗакрепленныеСотрудники");

	ТабДок.Очистить();
	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьЗаголовок);
		ТабДок.Вывести(ОбластьЗаголовок);
		Шапка.Параметры.Заполнить(Выборка);
		ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(Шапка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьЗакрепленныеСотрудникиШапка);
		ТабДок.Вывести(ОбластьЗакрепленныеСотрудникиШапка);
		ВыборкаЗакрепленныеСотрудники = Выборка.ЗакрепленныеСотрудники.Выбрать();
		Пока ВыборкаЗакрепленныеСотрудники.Следующий() Цикл
			ОбластьЗакрепленныеСотрудники.Параметры.Заполнить(ВыборкаЗакрепленныеСотрудники);
			ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьЗакрепленныеСотрудники);
			ТабДок.Вывести(ОбластьЗакрепленныеСотрудники, ВыборкаЗакрепленныеСотрудники.Уровень());

		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)

	Если ОбщийМодульПовтор.ВывестиНаименованияНаДругомЯзыке() Тогда
		ВозможноеПредставление = ОбщийМодульПовтор.получитьПредставлениеНаЯзыке(Данные.ссылка, , ИСТИНА);
		Если НЕ ВозможноеПредставление = Неопределено Тогда
			Представление = ВозможноеПредставление;
			СтандартнаяОбработка = ЛОЖЬ;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры
